# -*-coding: utf-8 -*
import amino
client = amino.Client()
infoos=input("Chat Url : ")
            
                                    
infoo=client.get_from_code(infoos)
chatId=infoo.objectId
comId=infoo.path[1:infoo.path.index("/")]
print ("\nUID =",chatId)
print ("comId =",comId)

mail= input ('Email = ')
pp = input (' Password : ')
client.login(email=mail, password=pp)
subclient = amino.SubClient(comId=comId,profile=client.profile)



#m=('اروح و اشرب الخمر لهذة يجب عليك أن تسمع الأمر لساني كة السيوف على كس اختك يا ديوث اكلمك فصحاً و انيك كس امك بطحاً بدك تجرب البطح ؟ عشان انيك أمك صفح اجلخ على كس اختك جلخ ارش على كسها الملح اخلي كسها حامض زي القلح اشرحلك الفاير وول شرح زي ابن الشرموطة خيرس و اذنابه كارلوس ينيك كس أمه من بابه ينيكك ب6 اكواد بل بايثون يضرب كس اختك زي مايك تايسون ينيكها هي و الMRX داخل كس امهم 6 طهورة مكس و ينيك اختهم بل عكس يطلع خواتهم من ال BOX و بعدين يعلمهم وش هو الSex يلعب بكس امهاتهم boxing و يرجع يعلمهم الFoxing و بعدين تحديات الأعتزال ولك هذا تنباع بل مزاد على كس خواتكم يا قحاب و بعدين يهايطون هم و البوت انزلكم فري مايك حتى الموت يجي حكومي و اخوه جلال انيكه انا و بلال لأني اشجع الهلال بحثت بقوقل عن المرادف اضرب كس اختك بل قاذف')

#m=(

 #﴿1﴾ ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِلْمُتَّقِينَ ﴿2﴾ الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ ﴿3﴾ وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ ﴿4﴾ أُولَٰئِكَ عَلَىٰ هُدًى مِنْ رَبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ ﴿5﴾ إِنَّ الَّذِينَ كَفَرُوا سَوَاءٌ عَلَيْهِمْ أَأَنْذَرْتَهُمْ أَمْ لَمْ تُنْذِرْهُمْ لَا يُؤْمِنُونَ ﴿6﴾ خَتَمَ اللَّهُ عَلَىٰ قُلُوبِهِمْ وَعَلَىٰ سَمْعِهِمْ ۖ وَعَلَىٰ أَبْصَارِهِمْ غِشَاوَةٌ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ ﴿7﴾ وَمِنَ النَّاسِ مَن يَقُولُ آمَنَّا بِاللَّهِ وَبِالْيَوْمِ الْآخِرِ وَمَا هُم بِمُؤْمِنِينَ ﴿8﴾ يُخَادِعُونَ اللَّهَ وَالَّذِينَ آمَنُوا وَمَا يَخْدَعُونَ إِلَّا أَنْفُسَهُمْ وَمَا يَشْعُرُونَ ﴿9﴾ فِي قُلُوبِهِمْ مَرَضٌ فَزَادَهُمُ اللَّهُ مَرَضًا ۖ وَلَهُمْ عَذَابٌ أَلِيمٌ بِمَا كَانُوا يَكْذِبُونَ ﴿10﴾ وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا فِي الْأَرْضِ قَالُوا إِنَّمَا نَحْنُ مُصْلِحُونَ ﴿11﴾ أَلَا إِنَّهُمْ هُمُ الْمُفْسِدُونَ وَلَٰكِنْ لَا يَشْعُرُونَ ﴿12﴾ وَإِذَا قِيلَ لَهُمْ آمِنُوا كَمَا آمَنَ النَّاسُ قَالُوا أَنُؤْمِنُ كَمَا آمَنَ السُّفَهَاءُ ۗ أَلَا إِنَّهُمْ هُمُ السُّفَهَاءُ وَلَٰكِنْ لَا يَعْلَمُونَ ﴿13﴾ وَإِذَا لَقُوا الَّذِينَ آمَنُوا قَالُوا آمَنَّا وَإِذَا خَلَوْا إِلَىٰ شَيَاطِينِهِمْ قَالُوا إِنَّا مَعَكُمْ إِنَّمَا نَحْنُ مُسْتَهْزِئُونَ ﴿14﴾ اللَّهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ ﴿15﴾ أُولَٰئِكَ الَّذِينَ اشْتَرَوُا الضَّلَالَةَ بِالْهُدَىٰ فَمَا رَبِحَتْ تِجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ ﴿16﴾ مَثَلُهُمْ كَمَثَلِ الَّذِي اسْتَوْقَدَ نَارًا فَلَمَّا أَضَاءَتْ مَا حَوْلَهُ ذَهَبَ اللَّهُ بِنُورِهِمْ وَتَرَكَهُمْ فِي ظُلُمَاتٍ لَا يُبْصِرُونَ ﴿17﴾ صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَرْجِعُونَ ﴿18﴾ أَوْ كَصَيِّبٍ مِنَ السَّمَاءِ فِيهِ ظُلُمَاتٌ وَرَعْدٌ وَبَرْقٌ يَجْعَلُونَ أَصَابِعَهُمْ فِي آذَانِهِمْ مِنَ الصَّوَاعِقِ حَذَرَ الْمَوْتِ ۚ وَاللَّهُ مُحِيطٌ بِالْكَافِرِينَ ﴿19﴾ يَكَادُ الْبَرْقُ يَخْطَفُ أَبْصَارَهُمْ ۖ كُلَّمَا أَضَاءَ لَهُمْ مَشَوْا فِيهِ وَإِذَا أَظْلَمَ عَلَيْهِمْ قَامُوا ۚ وَلَوْ شَاءَ اللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَارِهِمْ ۚ إِنَّ اللَّهَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ ﴿20﴾ يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ ﴿21﴾ الَّذِي جَعَلَ لَكُمُ الْأَرْضَ فِرَاشًا وَالسَّمَاءَ بِنَاءً وَأَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجَ بِهِ مِنَ ا

m=("""

_______________________________
قرصان عمك نايك امك شايل اختك  على تختك
والله غير اشوي على طيز اختك نفر كباب
وافجر ايري برحم امك واسوي ارهاب
وكل ما نيك فيها تقلي بعد اخو الشباب
اخو بلاعة العير مستنقع الجب
كسختك اخت جروبك
لو ما امك تدق هجع لو ما كسختك من عيري شبع
ما شليا عرض طيز اختك بالمنتجع
______________________________


""")
  


k=True
while k is True:


    try:
       subclient.send_message(message=m,messageType=115,chatId=chatId)

    except:
        pass



